Repository: 0xthuve/safeMother-mobApp-Flutter
Catalog: lib/l10n/app_*.arb
Languages: si, ta

# appointmentExample
source: e.g., Regular checkup, Consultation
si: උදා., සාමාන්‍ය පරීක්ෂණය, උපදේශනය
ta: எ.கா., வழக்கமான சோதனை, ஆலோசனை

source: Additional Notes (Optional)
si: අමතර සටහන් (විකල්ප)
ta: கூடுதல் குறிப்புகள் (விருப்பமானது)

# specificConcerns
source: Any specific concerns or information
si: ඕනෑම විශේෂිත සැලසීම් හෝ තොරතුරු
ta: எந்தவொரு குறிப்பிட்ட கவலைகள் அல்லது தகவல்கள்

# bookAppointmentButton
source: Book Appointment
si: නියම කිරීම් සුරක්ෂිත කරන්න
ta: நியமனம் முன்பதிவு செய்யவும்

# appointmentBookedSuccess
source: Appointment booked successfully!
si: නියම කිරීම් සාර්ථකව සුරක්ෂිත කරන ලදී!
ta: நியமனம் வெற்றிகரமாக முன்பதிவு செய்யப்பட்டது!

# quickChatTitle
source: Quick Chat
si: ඉක්මන් කතාබහ
ta: விரைவு அரட்டை

# chooseDoctorChat
source: Choose a doctor to start chatting:
si: කතාබහ අරඹීමට වෛද්‍යවරයෙකු තෝරන්න:
ta: அரட்டையைத் தொடங்க ஒரு மருத்துவரைத் தேர்ந்தெடுக்கவும்:

source: AI Chat
si: AI කතාබහ
ta: AI அரட்டை

# linkDoctorFirstChat
source: Please link with a doctor first to start chatting
si: කතාබහ අරඹීමට පළමුව වෛද්‍යවරයෙකු සම්බන්ධ කරන්න
ta: அரட்டையைத் தொடங்க முதலில் ஒரு மருத்துவருடன் இணைக்கவும்

# startConversation
source: Start a conversation with Dr. {doctorName}
si: ඩොක්ටර් {doctorName} සමඟ කතාබහක් අරඹින්න
ta: டாக்டர் {doctorName} உடன் ஒரு உரையாடலைத் தொடங்குங்கள்

# messagesSecure
source: Your messages are secure and private
si: ඔබගේ පණිවිඩ ආරක්ෂිත සහ පුද්ගලික වේ
ta: உங்கள் செய்திகள் பாதுகாப்பானவை மற்றும் தனிப்பட்டவை

# typeMessage
source: Type your message...
si: ඔබගේ පණිවිඩය ටයිප් කරන්න...
ta: உங்கள் செய்தியைத் தட்டச்சு செய்யவும்...

source: Now
si: දැන්
ta: இப்போது

# minutesAgo
source: {minutes}m ago
si: {minutes}මි පෙර
ta: {minutes}நி அகோ

# hoursAgo
source: {hours}h ago
si: {hours}පැ පෙර
ta: {hours}மணி அகோ

# failedSendMessage
source: Failed to send message. Please try again.
si: පණිවිඩය යැවීමට නොහැකි විය. කරුණාකර නැවත උත්සාහ කරන්න.
ta: செய்தியை அனுப்புவதில் தோல்வி. மீண்டும் முயற்சிக்கவும்.

# goToProfileSettings
source: Go to Profile → Settings → Link with Doctors
si: පැතිකඩ → සැකසීම් → වෛද්‍යවරුන් සම්බන්ධ කිරීමට යන්න
ta: சுயவிவரம் → அமைப்புகள் → மருத்துவர்களுடன் இணைக்க செல்லுங்கள்

# safeMotherTitle
source: Safe Mother
si: නිවැරදි මව
ta: பாதுகாப்பான தாய்

source: Good morning
si: සුභ උදෑසනක්
ta: காலை வணக்கம்

source: Good afternoon
si: සුභ සවසක්
ta: மதிய வணக்கம்

source: Good evening
si: සුභ සන්ධ්‍යාවක්
ta: மாலை வணக்கம்

# mealDescription
source: Description:
si: විස්තරය:
ta: விளக்கம்:

source: Nutritional Benefits:
si: පෝෂණමය ප්‍රයෝජන:
ta: ஊட்டச்சத்து நன்மைகள்:

source: Ingredients:
si: අමතර:
ta: பொருட்கள்:

source: Preparation:
si: සූදානම:
ta: தயாரிப்பு:

source: Safe for Pregnancy
si: ගැබ්බුම් සඳහා ආරක්ෂිත
ta: கர்ப்பத்திற்கு பாதுகாப்பானது

# difficultyLabel
source: Difficulty: {difficulty}
si: දුෂ්කරතාවය: {difficulty}
ta: கடினத்தன்மை: {difficulty}

# exerciseDescription
source: Description:
si: විස්තරය:
ta: விளக்கம்:

# exerciseBenefits
source: Benefits:
si: ප්‍රයෝජන:
ta: நன்மைகள்:

source: Safe for:
si: ආරක්ෂිත:
ta: பாதுகாப்பானது:

# consultDoctorBefore
source: Consult with your doctor before performing
si: කිරීමට පෙර ඔබගේ වෛද්‍යවරයාට උපදෙස් ගන්න
ta: செய்வதற்கு முன் உங்கள் மருத்துவரை ஆலோசிக்கவும்

source: Safe Mother - Learn
si: නිවැරදි මව - ඉගෙනීම
ta: பாதுகாப்பான தாய் - கற்றல்

source: All
si: සියල්ල
ta: அனைத்தும்

source: Pregnancy
si: ගැබ්ගැනීම
ta: கர்ப்பம்

source: Health
si: සෞඛ්‍යය
ta: உடல்நலம்

source: Nutrition
si: පෝෂණය
ta: ஊட்டச்சத்து

source: Baby
si: ළදරුවා
ta: குழந்தை

source: Parenting
si: මාපියකම
ta: பெற்றோர் பராமரிப்பு

# failedLoadArticles
source: Failed to load articles. Please try again later.
si: ලිපි පූරණය කිරීමට නොහැකි විය. කරුණාකර පසුව නැවත උත්සාහ කරන්න.
ta: கட்டுரைகளை ஏற்றுவதில் தோல்வி. பின்னர் மீண்டும் முயற்சிக்கவும்.

source: No title
si: මාතෘකාවක් නැත
ta: தலைப்பு இல்லை

source: No description
si: විස්තරයක් නැත
ta: விளக்கம் இல்லை

# publishedLabel
source: Published: {date}
si: ප්‍රකාශිත කරන ලදී: {date}
ta: வெளியிடப்பட்டது: {date}

# sourceLabel
source: Source: {source}
si: මූලාශ්‍රය: {source}
ta: மூலம்: {source}

# articleUrlNotAvailable
source: Article URL is not available
si: ලිපියේ URL නොමැති වේ
ta: கட்டுரை URL கிடைக்கவில்லை

# couldNotOpenArticle
source: Could not open article. Error: {error}
si: ලිපිය විවෘත කළ නොහැකි විය. දෝෂය: {error}
ta: கட்டுரையைத் திறக்க முடியவில்லை. பிழை: {error}

source: Learn
si: ඉගෙන ගන්න
ta: கற்றுக்கொள்

source: Search articles
si: ලිපි සොයන්න
ta: கட்டுரைகளைத் தேடுங்கள்

source: No Articles Found
si: ලිපි හමු නොවීය
ta: கட்டுரைகள் கிடைக்கவில்லை

source: Home
si: නිවස
ta: வீடு

source: Log
si: ලොග් කරන්න
ta: பதிவு

# consultationNav
source: Consultation
si: උපදේශනය
ta: ஆலோசனை

source: Chat
si: කතාබහ
ta: அரட்டை

source: Pregnancy Information
si: ගැබ්ගැනීමේ තොරතුරු

source: Expected Delivery Date
si: අපේක්ෂිත ප්‍රසූති දිනය

source: Pregnancy Confirmed Date
si: ගැබ්ගැනීම තහවුරු කරන ලද දිනය

source: Weight
si: බර
ta: எடை

source: First Child
si: පළමු දරුවා

source: Previous Pregnancy Loss
si: හිටපු ගැබ්ගැනීමේ පාඩුව

source: Medical History
si: වෛද්‍ය ඉතිහාසය

source: Not provided
si: සපයා නොමැති වේ

source: Profile updated successfully!
si: පැතිකඩ සාර්ථකව යාවත්කාලීන කරන ලදී!

# failedToUpdateProfile
source: Failed to update profile: {error}
si: පැතිකඩ යාවත්කාලීන කිරීමට නොහැකි විය: {error}

source: Personal Information
si: පුද්ගල තොරතුරු

source: Medical Information
si: වෛද්‍ය තොරතුරු

source: Full Name
si: සම්පූර්ණ නම

source: Email Address
si: විද්‍යුත් තැපැල් ලිපිනය

source: Blood Type
si: රුධිර වර්ගය

source: Phone Number
si: දුරකථන අංකය

source: Allergies (comma separated)
si: අලර්ජි (කොමාවෙන් වෙන්කරන ලද)

source: Emergency Contact Name
si: හදිසියක ලෙස සම්බන්ධ වන නම

source: Emergency Contact Phone
si: හදිසියක ලෙස සම්බන්ධ වන දුරකථනය

# pleaseEnterFullName
source: Please enter your full name
si: කරුණාකර ඔබගේ සම්පූර්ණ නම ඇතුලත් කරන්න

# pleaseEnterEmail
source: Please enter your email
si: කරුණාකර ඔබගේ විද්‍යුත් තැපැල ඇතුලත් කරන්න

# pleaseEnterValidEmail
source: Please enter a valid email
si: කරුණාකර වලංගු විද්‍යුත් තැපැලක් ඇතුලත් කරන්න

source: Enter valid age
si: වලංගු වයසක් ඇතුලත් කරන්න

# pleaseEnterValidPhoneNumber
source: Please enter a valid phone number
si: කරුණාකර වලංගු දුරකථන අංකයක් ඇතුලත් කරන්න

# allergiesExample
source: e.g., Penicillin, Peanuts, Shellfish
si: උදා., පෙනිසිලින්, ගෙඩි, මාළු

source: Save Changes
si: වෙනස්කම් සුරකින්න

source: Pregnancy Journey
si: ගැබ්ගැනීමේ යාත්‍රාව

source: Setup Your Pregnancy Journey
si: ඔබගේ ගැබ්ගැනීමේ යාත්‍රාව ස්ථාපනය කරන්න

source: Progress
si: ප්‍රගතිය

source: Total Days
si: මුළු දින

source: Remaining
si: ඉතිරි

source: WEEKS
si: සති

source: days
si: දින

source: Due Date (Overdue)
si: නියමිත දිනය (කල් පිරිනමා ඇත)

# babyCanArriveAnyTime
source: Baby can arrive any time now!
si: ළදරුවා ඕනෑම විටක පැමිණිය හැක!

source: Trimester Progress
si: ත්‍රිමාසික ප්‍රගතිය

# weekOf
source: Week {current} of {total}
si: සතිය {current} න් {total}

source: Heart Begins Beating
si: හදවත ගැටළුවීමට පටන් ගන්නවා

# heartBeginsBeatingDesc
source: Your baby's heart starts to beat
si: ඔබගේ ළදරුවාගේ හදවත ගැටළුවීමට පටන් ගන්නවා

source: All Major Organs
si: සියලුම ප්‍රධාන අවයව

# allMajorOrgansDesc
source: All major organs are now formed
si: සියලුම ප්‍රධාන අවයව දැන් සාදන ලදි

source: End of First Trimester
si: පළමු ත්‍රිමාසයේ අවසානය

# endOfFirstTrimesterDesc
source: Risk of miscarriage decreases significantly
si: ගැබ්ගැනීමේ අවාසි තරංගය සැලකිය යුතු ලෙස අඩු වේ

source: Gender Determination
si: ස්ත්‍රී පුරුෂ භාවය තීරණය කිරීම

# genderDeterminationDesc
source: Baby's gender can be determined
si: ළදරුවාගේ ස්ත්‍රී පුරුෂ භාවය තීරණය කළ හැක

# halfwayPointDesc
source: You're halfway through your pregnancy!
si: ඔබ ඔබගේ ගැබ්ගැනීමේ අඩක් ඉක්මවා ඇත!

source: Viability Milestone
si: ජීවිතයේ මෝඩ්ස්ටෝන්

# viabilityMilestoneDesc
source: Baby has a good chance of survival if born
si: උපන්නේ නම් ළදරුවාට ජීවිතයේ හොඳ අවස්ථාවක් ඇත

source: Eyes Can Open
si: ඇස් විවෘත කළ හැක

# eyesCanOpenDesc
source: Baby's eyes can open and close
si: ළදරුවාගේ ඇස් විවෘත කළ හැකි සහ වැසිය හැකි වේ

source: Rapid Weight Gain
si: වේගවත් බර ලබා ගැනීම

# rapidWeightGainDesc
source: Baby is gaining weight rapidly
si: ළදරුවා වේගවත්ව බර ලබා ගන්නවා

source: Considered Full-Term
si: සම්පූර්ණ කාලයක් ලෙස සලකනු ලැබේ

# consideredFullTermDesc
source: Baby is now considered full-term
si: ළදරුවා දැන් සම්පූර්ණ කාලයක් ලෙස සලකනු ලැබේ

# dueDateDesc
source: Your estimated due date arrives!
si: ඔබගේ ඇස්තමේන්තු කරන ලද නියමිත දිනය පැමිණේ!

source: COMPLETED
si: සම්පූර්ණයි
ta: முடிந்தது

source: Current
si: වර්තමාන

source: Development
si: වර්ධනය

source: This Week's Tips
si: මෙම සතියේ උපදෙස්

# familyWelcomeMessage
source: Supporting your loved one through this beautiful journey
si: ඔබගේ ප්‍රියතමයාට මෙම සුන්දර යාත්‍රාවේදී සහාය වීම
ta: உங்கள் அன்பானவருக்கு இந்த அழகான பயணத்தில் ஆதரவளித்தல்

source: Caregiver
si: සත්කාරක
ta: பராமரிப்பாளர்

source: Health Overview
si: සෞඛ්‍ය දෘශ්‍යමානය
ta: உடல்நலக் கண்ணோட்டம்

source: View All Health Data
si: සියලු සෞඛ්‍ය දත්ත බලන්න
ta: அனைத்து உடல்நலத் தரவையும் பார்க்கவும்

source: Recent Activity
si: මෑත ක්‍රියාකාරකම්
ta: சமீபத்திய செயல்பாடு

source: Last Health Update
si: අවසාන සෞඛ්‍ය යාවත්කාලීනය
ta: கடைசி உடல்நலப் புதுப்பிப்பு

source: Linked Patient
si: සම්බන්ධිත රෝගියා
ta: இணைக்கப்பட்ட நோயாளி

source: Patient Name
si: රෝගියාගේ නම
ta: நோயாளியின் பெயர்

source: Relationship
si: සම්බන්ධතාවය
ta: உறவு

source: Connection Status
si: සම්බන්ධතා තත්ත්වය
ta: இணைப்பு நிலை

source: Privacy & Security
si: පුද්ගලිකත්ව සහ ආරක්ෂාව
ta: தனியுரிமை மற்றும் பாதுகாப்பு

source: Family Member
si: පවුලේ සාමාජිකයෙක්
ta: குடும்ப உறுப்பினர்

source: Linked to
si: සම්බන්ධිතයි
ta: இணைக்கப்பட்டுள்ளது

source: Edit
si: සංස්කරණය
ta: திருத்து

source: Enter your
si: ඔබගේ ආදානය කරන්න
ta: உங்கள் உள்ளீடு செய்யவும்

source: Update
si: යාවත්කාලීන කරන්න
ta: புதுப்பிக்கவும்

# passwordMinLength
source: Password must be at least 6 characters long!
si: මුරපදය අවම වශයෙන් අක්ෂර 6 ක් වැඩි විය යුතුය!
ta: கடவுச்சொல் குறைந்தது 6 எழுத்துகள் நீளமாக இருக்க வேண்டும்!

# passwordUpdated
source: Password updated successfully!
si: මුරපදය සාර්ථකව යාවත්කාලීන කරන ලදී!
ta: கடவுச்சொல் வெற்றிகரமாக புதுப்பிக்கப்பட்டது!

# failedUpdatePassword
source: Failed to update password
si: මුරපදය යාවත්කාලීන කිරීමට අසාර්ථක විය
ta: கடவுச்சொல்லை புதுப்பிப்பதில் தோல்வி

# privacyDescriptionFamily
source: Your privacy and the security of {patientName}'s medical information are our top priority. All data is encrypted and stored securely. Family members can only access information that is explicitly shared with them.
si: ඔබගේ පුද්ගලිකත්ව සහ {patientName}ගේ වෛද්‍ය තොරතුරුවල ආරක්ෂාව අපගේ ප්‍රධාන ප්‍රමුඛතාවයි. සියලු දත්ත සංකේතනය කර ආරක්ෂිතව ගබඩා කරනු ලැබේ. පවුලේ සාමාජිකයින්ට සංස්කරණය කරන ලද තොරතුරු පමණක් ප්‍රවේශ විය හැක.
ta: உங்கள் தனியுரிமை மற்றும் {patientName} இன் மருத்துவத் தகவல்களின் பாதுகாப்பு எங்கள் முதன்மை முன்னுரிமை. அனைத்து தரவுகளும் குறியாக்கம் செய்யப்பட்டு பாதுகாப்பாக சேமிக்கப்படுகின்றன. குடும்ப உறுப்பினர்கள் வெளிப்படையாக பகிரப்பட்ட தகவல்களை மட்டுமே அணுக முடியும்.

source: updated successfully!
si: සාර්ථකව යාවත්කාලීන කරන ලදී!
ta: வெற்றிகரமாக புதுப்பிக்கப்பட்டது!

# failedUpdateField
source: Failed to update {field}: {error}
si: {field} යාවත්කාලීන කිරීමට අසාර්ථක විය: {error}
ta: {field} புதுப்பிப்பதில் தோல்வி: {error}

# errorSigningOut
source: Error signing out: {error}
si: ඉවත් වීමේ දෝෂය: {error}
ta: வெளியேறுவதில் பிழை: {error}

source: Signed out successfully
si: සාර්ථකව ඉවත් විය
ta: வெற்றிகரமாக வெளியேறினார்

# patientHealthLogs
source: {patientName}'s Health Logs
si: {patientName}ගේ සෞඛ්‍ය පටිගත
ta: {patientName} இன் ஆரோக்கிய பதிவுகள்

# viewingRecentHealthUpdates
source: Viewing recent health updates and vital signs
si: මෑත සෞඛ්‍ය යාවත්කාලීන සහ ප්‍රධාන ලක්ෂණ බැරෑරුම් කිරීම
ta: சமீபத்திய ஆரோக்கிய புதுப்பிப்புகள் மற்றும் முக்கிய அறிகுறிகளைப் பார்க்கிறது

# healthLogsWillAppear
source: Health logs will appear here when {patientName} starts tracking
si: {patientName} ලුහුබඳිනවා අරඹින විට සෞඛ්‍ය පටිගත මෙහි පෙනුනු වේ
ta: {patientName} கண்காணிப்பைத் தொடங்கும் போது ஆரோக்கிய பதிவுகள் இங்கே தோன்றும்

source: Recent Logs
si: මෑත පටිගත
ta: சமீபத்திய பதிவுகள்

source: Blood Pressure
si: රුධිර පීඩනය
ta: இரத்த அழுத்தம்

source: Baby Kicks
si: ළදරුවාගේ පා
ta: குழந்தை உதை

# sleepHours
source: Sleep
si: නින්ද
ta: தூக்கம்

source: Water Intake
si: ජල පරිභෝජනය
ta: நீர் உட்கொள்ளல்

# exerciseMinutes
source: Exercise
si: ව්‍යායාමය
ta: உடற்பயிற்சி

source: Mood
si: මනෝභාවය
ta: மனநிலை

source: Energy
si: ශක්තිය
ta: ஆற்றல்

source: Symptoms
si: ලක්ෂණ
ta: அறிகுறிகள்

source: Notes
si: සටහන්
ta: குறிப்புகள்

source: Medications
si: ඖෂධ
ta: மருந்துகள்

source: Nausea Details
si: වමනයේ විස්තර
ta: வாந்தி விவரங்கள்

source: Contractions
si: සංකෝචන
ta: சுருக்கங்கள்

source: Headaches
si: හිසරදය
ta: தலைவலி

source: Swelling
si: විඩාවට තිබීම
ta: வீக்கம்

source: Vitamins
si: විටමින්
ta: விட்டமின்கள்

source: High Risk
si: ඉහළ අවදානම
ta: உயர் அபாயம்

source: Moderate Risk
si: මධ්‍යම අවදානම
ta: நடுத்தர அபாயம்

source: Low Risk
si: අඩු අවදානම
ta: குறைந்த அபாயம்

source: Excellent
si: අතිශයෝක්තියි
ta: மிகச்சிறப்பானது

source: Good
si: හොඳයි
ta: நல்லது

source: Okay
si: හොඳින්ම
ta: சரி

source: Low
si: අඩුයි
ta: குறைந்தது

source: Anxious
si: පීඩාවෙන් යුක්ත
ta: கவலை கொண்ட

source: View Log
si: පටිගත බලන්න
ta: பதிவைப் பார்

source: Safe Mother
si: සුරක්ෂිත මව
ta: பாதுகாப்பான தாய்

# patientAppointments
source: {patientName}'s Appointments
si: {patientName}ගේ නියමයන්
ta: {patientName} இன் நியமனங்கள்

# trackManageAppointments
source: Track and manage healthcare appointments
si: සෞඛ්‍ය සත්කාර නියමයන් ලුහුබඳින්න සහ කළමනාකරණය කරන්න
ta: சுகாதார நியமனங்களை கண்காணித்து நிர்வகிக்கவும்

source: UPCOMING
si: ඉදිරිපත්
ta: வரவிருக்கும்

source: TODAY
si: අද
ta: இன்று

source: TOMORROW
si: හෙට
ta: நாளை

source: Completed Appointments
si: සම්පූර්ණ කරන ලද නියමයන්
ta: முடிந்த நியமனங்கள்

source: No Appointments
si: නියමයන් නැත
ta: நியமனங்கள் இல்லை

# noAppointmentsFound
source: No appointments found for {patientName}.
si: {patientName} සඳහා නියමයන් හමු නොවීය.
ta: {patientName} க்கு நியமனங்கள் கிடைக்கவில்லை.

# noAppointmentsDialog
source: No Appointments
si: නියමයන් නැත
ta: நியமனங்கள் இல்லை

# noAppointmentsDialogMessage
source: No appointment schedules found for {patientName}. Appointments will appear here when scheduled.
si: {patientName} සඳහා නියම කාලසටහන් හමු නොවීය. නියම කරන විට නියමයන් මෙහි පෙනුනු වේ.
ta: {patientName} க்கு நியமன அட்டவணை கிடைக்கவில்லை. நியமனம் செய்யப்படும்போது இங்கே தோன்றும்.

source: Firestore Error
si: ෆයර්ස්ටෝර් දෝෂය
ta: பயர்ஸ்டோர் பிழை

source: Connection Error
si: සම්බන්ධතා දෝෂය
ta: இணைப்பு பிழை

# unableToLoadAppointments
source: Unable to load appointments. Please check your connection and try again.
si: නියමයන් පූරණය කළ නොහැක. කරුණාකර ඔබගේ සම්බන්ධතාවය පරීක්ෂා කර නැවත උත්සාහ කරන්න.
ta: நியமனங்களை ஏற்ற முடியவில்லை. உங்கள் இணைப்பை சரிபார்த்து மீண்டும் முயற்சிக்கவும்.

# unexpectedError
source: An unexpected error occurred while loading appointments.
si: නියමයන් පූරණය කිරීමේදී අනපේක්ෂිත දෝෂයක් සිදු විය.
ta: நியமனங்களை ஏற்றும் போது எதிர்பாராத பிழை ஏற்பட்டது.

# failedToLoadAppointments
source: Failed to load appointments: {error}
si: නියමයන් පූරණය කළ නොහැක: {error}
ta: நியமனங்களை ஏற்றுவதில் தோல்வி: {error}

source: Video call available
si: වීඩියෝ ඇමතුම් ලබා ගත හැක
ta: வீடியோ அழைப்பு கிடைக்கிறது

source: Join Call
si: ඇමතුමට සම්බන්ධ වන්න
ta: அழைப்பில் சேரவும்

source: Joining video call...
si: වීඩියෝ ඇමතුමට සම්බන්ධ වෙමින්...
ta: வீடியோ அழைப்பில் சேர்கிறது...

# appointmentsLoadingBasicSorting
source: Appointments loading with basic sorting (index building...)
si: නියමයන් මූලික වින්‍යාසය සමඟ පූරණය වෙමින් (අනුක්‍රමණය ගොඩනැගෙමින්...)
ta: நியமனங்கள் அடிப்படை வரிசைப்படுத்தலுடன் ஏற்றப்படுகின்றன (குறியீடு கட்டப்படுகிறது...)

# appointmentsLoadingBasicSortingFull
source: Appointments loading with basic sorting. Full sorting will be available soon.
si: නියමයන් මූලික වින්‍යාසය සමඟ පූරණය වෙමින්. සම්පූර්ණ වින්‍යාසය ඉක්මනින් ලබා ගත හැකි වේ.
ta: நியமனங்கள் அடிப்படை வரிசைப்படுத்தலுடன் ஏற்றப்படுகின்றன. முழு வரிசைப்படுத்தல் விரைவில் கிடைக்கும்.

source: OK
si: හරි
ta: சரி

# pregnancyAndParentingGuide
source: Pregnancy & Parenting Guide
si: ගර්භනී සහ මාපියකම් මාර්ගෝපදේශ
ta: கர்ப்பம் மற்றும் பெற்றோர் வழிகாட்டி

# latestArticlesAndResources
source: Latest articles and resources for {patientName}'s pregnancy journey
si: {patientName}ගේ ගර්භනී ගමනය සඳහා නවතම ලිපි සහ සම්පත
ta: {patientName} இன் கர்ப்பப் பயணத்திற்கான சமீபத்திய கட்டுரைகள் மற்றும் வளங்கள்

source: Search pregnancy articles...
si: ගර්භනී ලිපි සොයන්න...
ta: கர்ப்பக் கட்டுரைகளைத் தேடு...

source: Loading articles...
si: ලිපි පූරණය වෙමින්...
ta: கட்டுரைகள் ஏற்றப்படுகின்றன...

source: Unable to Load Articles
si: ලිපි පූරණය කළ නොහැක
ta: கட்டுரைகளை ஏற்ற முடியவில்லை

# failedToLoadArticles
source: Failed to load articles. Please try again later.
si: ලිපි පූරණය කළ නොහැක. කරුණාකර පසුව නැවත උත්සාහ කරන්න.
ta: கட்டுரைகளை ஏற்ற முடியவில்லை. தயவுசெய்து பின்னர் மீண்டும் முயற்சிக்கவும்.

source: Try Again
si: නැවත උත්සාහ කරන්න
ta: மீண்டும் முயற்சிக்கவும்

# tryAdjustingSearch
source: Try adjusting your search or category filter
si: ඔබගේ සෙවීම හෝ කාණ්ඩ පෙරහන සකස් කර උත්සාහ කරන්න
ta: உங்கள் தேடலை அல்லது வகை வடிப்பை சரிசெய்ய முயற்சிக்கவும்

source: Read Article
si: ලිපිය කියවන්න
ta: கட்டுரையைப் படிக்கவும்

# cannotOpenArticle
source: Cannot open article: {url}
si: ලිපිය විවෘත කළ නොහැක: {url}
ta: கட்டுரையைத் திறக்க முடியவில்லை: {url}
