Repository: 0xthuve/safeMother-mobApp-Flutter
Catalog: lib/l10n/app_*.arb
Languages: si, ta

# appTitle
source: Safe Mother
si: නිවැරදි මව
ta: பாதுகாப்பான தாய்

# welcomeMessage
source: Welcome to Safe Mother
si: නිවැරදි මව යෙදුමට පිළිගනිමු
ta: பாதுகாப்பான தாய் பயன்பாட்டிற்கு வரவேற்கிறோம்

# loginButton
source: Login
si: ඇතුල් වන්න
ta: உள்நுழை

# registerButton
source: Register
si: ලියාපදිංචි වන්න
ta: பதிவு செய்

source: My Profile
si: මගේ පැතිකඩ
ta: எனது சுயவிவரம்

# personalInfo
source: Personal Information
si: පුද්ගලික තොරතුරු
ta: தனிப்பட்ட தகவல்

source: Quick Actions
si: ඉක්මන් ක්‍රියාකාරකම්
ta: விரைவு செயல்கள்

source: Edit Profile
si: පැතිකඩ වෙනස් කරන්න
ta: சுயவிவரத்தைத் திருத்து

source: Change Password
si: මුරපදය වෙනස් කරන්න
ta: கடவுச்சொல்லை மாற்று

source: Account Settings
si: ගිණුම් සැකසීම්
ta: கணக்கு அமைப்புகள்

source: Privacy Settings
si: පුද්ගලිකත්ව සැකසීම්
ta: தனியுரிமை அமைப்புகள்

source: My Doctors
si: මගේ වෛද්‍යවරු
ta: எனது மருத்துவர்கள்

source: Family & Doctor Link
si: පවුල් සහ වෛද්‍ය සම්බන්ධතාවය
ta: குடும்பம் & மருத்துவர் இணைப்பு

source: Link Family Members
si: පවුලේ සාමාජිකයින් සම්බන්ධ කරන්න
ta: குடும்ப உறுப்பினர்களை இணைக்கவும்

source: Link Doctors
si: වෛද්‍යවරුන් සම්බන්ධ කරන්න
ta: மருத்துவர்களை இணைக்கவும்

source: Patient ID
si: රෝගියාගේ හැඳුනුම්පත
ta: நோயாளி ஐடி

source: Name
si: නම
ta: பெயர்

source: Email
si: විද්‍යුත් තැපෑල
ta: மின்னஞ்சல்

source: Age
si: වයස
ta: வயது

source: Contact
si: සම්බන්ධතාවය
ta: தொடர்பு

source: Role
si: කාර්යභාරය
ta: பங்கு

source: Mother
si: මව
ta: தாய்

source: Not set
si: සකසා නැත
ta: அமைக்கப்படவில்லை

source: Not available
si: ලබා ගත නොහැක
ta: கிடைக்கவில்லை

# patientIdCopied
source: Patient ID copied to clipboard
si: රෝගියාගේ හැඳුනුම්පත පසුරුපහදුවට පිටපත් කරන ලදී
ta: நோயாளி ஐடி கிளிப்போர்டுக்கு நகலெடுக்கப்பட்டது

source: Copy Patient ID
si: රෝගියාගේ හැඳුනුම්පත පිටපත් කරන්න
ta: நோயாளி ஐடியை நகலெடு

# sharePatientId
source: Share your Patient ID with family members so they can register and link their accounts to receive updates about your pregnancy journey.
si: ඔබගේ පවුලේ සාමාජිකයින් සමඟ ඔබගේ රෝගියාගේ හැඳුනුම්පත බෙදා ගන්න, එවිට ඔවුන්ට ලියාපදිංචි වී ඔවුන්ගේ ගිණුම් සම්බන්ධ කර ඔබගේ ගැබ්බුම් ගමනේ යාවත්කාලීන ලබා ගත හැක.
ta: உங்கள் குடும்ப உறுப்பினர்களுடன் உங்கள் நோயாளி ஐடியைப் பகிர்ந்து கொள்ளுங்கள், இதனால் அவர்கள் பதிவு செய்து தங்கள் கணக்குகளை இணைத்து உங்கள் கர்ப்பப் பயணத்தைப் பற்றிய புதுப்பிப்புகளைப் பெறலாம்.

# familyMembersInfo
source: Family members can use this ID during registration to create linked accounts and receive pregnancy updates.
si: පවුලේ සාමාජිකයින්ට ලියාපදිංචි වීමේදී මෙම හැඳුනුම්පත භාවිතා කර සම්බන්ධිත ගිණුම් නිර්මාණය කර ගැබ්බුම් යාවත්කාලීන ලබා ගත හැක.
ta: குடும்ப உறுப்பினர்கள் பதிவின் போது இந்த ஐடியைப் பயன்படுத்தி இணைக்கப்பட்ட கணக்குகளை உருவாக்கி கர்ப்பப் புதுப்பிப்புகளைப் பெறலாம்.

source: Close
si: වැසීම
ta: மூடு

source: Safe Mother Privacy
si: නිවැරදි මව පුද්ගලිකත්වය
ta: பாதுகாப்பான தாய் தனியுரிமை

# privacyDescription
source: Your privacy and safety are our top priority. We ensure that your personal and medical information is securely protected and never shared without your consent. Safe Mother safeguards your details to provide you with confidential and trusted care.
si: ඔබගේ පුද්ගලිකත්වය සහ ආරක්ෂාව අපගේ ප්‍රධාන ප්‍රමුඛතාවය වේ. ඔබගේ පුද්ගලික සහ වෛද්‍ය තොරතුරු ආරක්ෂිතව ආරක්ෂා කරන බව සහතික කරමු, ඔබගේ එකඟතාවයකින් තොරව එකවිටත් බෙදා නොගනිනවා. නිවැරදි මව ඔබගේ විස්තර රහසිගතව සහ විශ්වාසදායක සත්කාරය සපයයි.
ta: உங்கள் தனியுரிமை மற்றும் பாதுகாப்பு எங்கள் முதன்மை முன்னுரிமை. உங்கள் தனிப்பட்ட மற்றும் மருத்துவத் தகவல்கள் பாதுகாப்பாகப் பாதுகாக்கப்படுவதை உறுதிசெய்கிறோம், உங்கள் ஒப்புதலின்றி ஒருபோதும் பகிரப்படாது. பாதுகாப்பான தாய் உங்கள் விவரங்களை ரகசியமாகவும் நம்பகமான பராமரிப்பை வழங்குகிறது.

source: Sign Out
si: අත්හරින්න
ta: வெளியேறு

# signOutConfirm
source: Are you sure you want to sign out of your account?
si: ඔබට ඔබගේ ගිණුමෙන් ඉවත් වීමට අවශ්‍ය බව විශ්වාසද?
ta: உங்கள் கணக்கில் இருந்து வெளியேற விரும்புகிறீர்களா?

source: Cancel
si: අවලංගු කරන්න
ta: ரத்து செய்

# signOutSuccess
source: Successfully signed out
si: සාර්ථකව ඉවත් විය
ta: வெற்றிகரமாக வெளியேறினார்

source: Sign out failed
si: ඉවත් වීම අසාර්ථක විය
ta: வெளியேறுதல் தோல்வியடைந்தது

# passwordChanged
source: Password changed successfully!
si: මුරපදය සාර්ථකව වෙනස් කරන ලදී!
ta: கடவுச்சொல் வெற்றிகரமாக மாற்றப்பட்டது!

source: Dashboard
si: උපකරණ පුවරුව
ta: டாஷ்போர்டு

source: No Doctors Assigned
si: වෛද්‍යවරුන් පැවරීම් කර නැත
ta: மருத்துவர்கள் ஒதுக்கப்படவில்லை

# connectDoctors
source: Connect with healthcare providers to get personalized care and guidance throughout your pregnancy journey.
si: ඔබගේ ගැබ්බුම් ගමනේදී පුද්ගලික සත්කාරය සහ මාර්ගෝපදේශ ලබා ගැනීම සඳහා සෞඛ්‍ය සේවා සපයන්නන් සමඟ සම්බන්ධ වන්න.
ta: உங்கள் கர்ப்பப் பயணம் முழுவதும் தனிப்பயன் பராமரிப்பு மற்றும் வழிகாட்டலைப் பெற சுகாதார வழங்குநர்களுடன் இணைக்கவும்.

# findDoctor
source: Find a Doctor
si: වෛද්‍යවරයෙකු සොයන්න
ta: மருத்துவரைத் தேடு

source: ACTIVE
si: සක්‍රිය
ta: செயலில்

source: Select Doctor
si: වෛද්‍යවරයා තෝරන්න
ta: மருத்துவரைத் தேர்ந்தெடுக்கவும்

source: Currently Linked:
si: දැනට සම්බන්ධිත:
ta: தற்போது இணைக்கப்பட்டுள்ளது:

# selectNewDoctor
source: Select a new doctor to change your current selection:
si: ඔබගේ වර්තමාන තේරීම වෙනස් කිරීමට නව වෛද්‍යවරයෙකු තෝරන්න:
ta: உங்கள் தற்போதைய தேர்வை மாற்ற புதிய மருத்துவரைத் தேர்ந்தெடுக்கவும்:

# selectDoctorGuide
source: Select a doctor to guide your pregnancy journey:
si: ඔබගේ ගැබ්බුම් ගමනට මාර්ගෝපදේශ කිරීමට වෛද්‍යවරයෙකු තෝරන්න:
ta: உங்கள் கர்ப்பப் பயணத்திற்கு வழிகாட்ட ஒரு மருத்துவரைத் தேர்ந்தெடுக்கவும்:

source: No doctors available
si: වෛද්‍යවරුන් නොමැති වේ
ta: மருத்துவர்கள் கிடைக்கவில்லை

source: Retry
si: නැවත උත්සාහ කරන්න
ta: மீண்டும் முயற்சிக்கவும்

source: Send Request
si: ඉල්ලීම යවන්න
ta: கோரிக்கையை அனுப்பு

source: Send New Request
si: නව ඉල්ලීම යවන්න
ta: புதிய கோரிக்கையை அனுப்பு

# requestSent
source: Request sent to {doctorName}. Waiting for approval.
si: {doctorName} වෙත ඉල්ලීම යවන ලදී. අනුමැතිය සඳහා රැඳී සිටීම.
ta: {doctorName}க்கு கோரிக்கை அனுப்பப்பட்டது. ஒப்புதலுக்காக காத்திருக்கிறது.

# requestFailed
source: Failed to send request to doctor
si: වෛද්‍යවරයාට ඉල්ලීම යැවීමට නොහැකි විය
ta: மருத்துவருக்கு கோரிக்கையை அனுப்புவதில் தோல்வி

source: Error
si: දෝෂයක්
ta: பிழை

# changePasswordTitle
source: Change Password
si: මුරපදය වෙනස් කරන්න
ta: கடவுச்சொல்லை மாற்று

source: Current Password
si: වර්තමාන මුරපදය
ta: தற்போதைய கடவுச்சொல்

source: New Password
si: නව මුරපදය
ta: புதிய கடவுச்சொல்

source: Confirm New Password
si: නව මුරපදය තහවුරු කරන්න
ta: புதிய கடவுச்சொல்லை உறுதிப்படுத்து

# enterCurrentPassword
source: Please enter current password
si: කරුණාකර වර්තමාන මුරපදය ඇතුල් කරන්න
ta: தற்போதைய கடவுச்சொல்லை உள்ளீடு செய்யவும்

# enterNewPassword
source: Please enter new password
si: කරුණාකර නව මුරපදය ඇතුල් කරන්න
ta: புதிய கடவுச்சொல்லை உள்ளீடு செய்யவும்

# passwordsNotMatch
source: New passwords do not match
si: නව මුරපද නොගැලපේ
ta: புதிய கடவுச்சொற்கள் பொருந்தவில்லை

source: Language
si: භාෂාව
ta: மொழி

source: English
si: ඉංග්‍රීසි
ta: ஆங்கிலம்

source: Tamil
si: දෙමළ
ta: தமிழ்

source: Sinhala
si: සිංහල
ta: சிங்களம்

source: Welcome back!
si: නැවත පිළිගනිමු!
ta: மீண்டும் வருக!

# feelingWell
source: Hope you're feeling well today
si: අද ඔබට හොඳින් සිටීමට සුබ පැතුම්
ta: இன்று நீங்கள் நலமாக உணர்கிறீர்கள் என்று நம்புகிறேன்

source: Appointments
si: නියමයන්
ta: சந்திப்புகள்

source: Reminders
si: සිහිකැඳවීම්
ta: நினைவூட்டல்கள்

source: Records
si: වාර්තා
ta: பதிவுகள்

source: Today's Reminders
si: අද සිහිකැඳවීම්
ta: இன்றைய நினைவூட்டல்கள்

# noRemindersToday
source: No reminders for today
si: අද සිහිකැඳවීම් නැත
ta: இன்று நினைவூட்டல்கள் இல்லை

source: Upcoming Appointments
si: ඉදිරිපත් නියමයන්
ta: வரவிருக்கும் நியமனங்கள்

source: No Upcoming Appointments
si: ඉදිරිපත් නියම කිරීම් නැත
ta: வரவிருக்கும் நியமனங்கள் இல்லை

source: Recent Medical Records
si: මෑත වෛද්‍ය වාර්තා
ta: சமீபத்திய மருத்துவப் பதிவுகள்

# noRecentRecords
source: No recent medical records
si: මෑත වෛද්‍ය වාර්තා නැත
ta: சமீபத்திய மருத்துவப் பதிவுகள் இல்லை

source: Book Appointment
si: නියම කිරීම් සුරක්ෂිත කරන්න
ta: நியமனம் முன்பதிவு செய்யவும்

source: Add Reminder
si: සිහිකැඳවීමක් එකතු කරන්න
ta: நினைவூட்டலைச் சேர்க்கவும்

source: Emergency Contact
si: හදිසියක ලෙස සම්බන්ධ වන්න
ta: அவசரத் தொடர்பு

source: Health Tips
si: සෞඛ්‍ය උපදෙස්
ta: உடல்நலக் குறிப்புகள்

# appointmentBookingComingSoon
source: Appointment booking feature coming soon!
si: නියම කිරීම් සුරක්ෂිත කිරීමේ විශේෂාංගය ඉක්මනින් පැමිණේ!
ta: நியமன முன்பதிவு அம்சம் விரைவில் வருகிறது!

# addReminderComingSoon
source: Add reminder feature coming soon!
si: සිහිකැඳවීමක් එකතු කිරීමේ විශේෂාංගය ඉක්මනින් පැමිණේ!
ta: நினைவூட்டலைச் சேர்க்கும் அம்சம் விரைவில் வருகிறது!

source: Emergency
si: හදිසියක
ta: அவசரநிலை

source: Hospital
si: රෝහල
ta: மருத்துவமனை

source: Doctor
si: වෛද්‍යවරයා
ta: மருத்துவர்

# stayHydrated
source: Stay hydrated - drink plenty of water
si: ජල සම්පූර්ණව සිටින්න - බොහෝ වතුර පානය කරන්න
ta: நீரேற்றமாக இருங்கள் - நிறைய தண்ணீர் குடிக்கவும்

# eatNutritious
source: Eat nutritious meals regularly
si: පෝෂණය සම්පූර්ණ ආහාර නිතිපතා ගන්න
ta: ஊட்டச்சத்து நிறைந்த உணவுகளை தொடர்ந்து சாப்பிடுங்கள்

# getAdequateRest
source: Get adequate rest (7-9 hours)
si: ප්‍රමාණවත් විස්සම්හරුවක් ලබා ගන්න (7-9 පැය)
ta: போதுமான ஓய்வைப் பெறுங்கள் (7-9 மணி நேரம்)

# lightExercise
source: Light exercise as approved by doctor
si: වෛද්‍යවරයාගේ අනුමැතිය මත පහසු ව්‍යායාම
ta: மருத்துவரால் அங்கீகரிக்கப்பட்ட இலகு உடற்பயிற்சி

# learnAndTips
source: Learn & Tips
si: ඉගෙනීම් සහ උපදෙස්
ta: கற்றல் & குறிப்புகள்

source: Today's Featured Tip
si: අද දිනයේ විශේෂිත උපදෙස්
ta: இன்றைய சிறப்பு குறிப்பு

source: Read Full Article
si: සම්පූර්ණ ලිපිය කියවන්න
ta: முழு கட்டுரையைப் படியுங்கள்

# noTipsAvailable
source: No tips available in this category
si: මෙම ප්‍රවේශයේ උපදෙස් නැත
ta: இந்த வகுப்பில் குறிப்புகள் இல்லை

source: Read more
si: තව කියවන්න
ta: மேலும் படியுங்கள்

source: Key Points
si: ප්‍රධාන කරුණු
ta: முக்கிய புள்ளிகள்

source: Detailed Information
si: විස්තරාත්මක තොරතුරු
ta: விரிவான தகவல்

source: Today Meal Preference
si: අද ආහාර වර්ගය
ta: இன்றைய உணவு விருப்பம்

source: Doctor Recommended
si: වෛද්‍යවරයා නිර්දේශ කරන ලදී
ta: மருத்துவர் பரிந்துரைத்தது

source: No Meal Prescribed
si: ආහාර නියම කර නැත
ta: உணவு பரிந்துரைக்கப்படவில்லை

# noMealPrescribedDesc
source: Your doctor hasn't prescribed any specific meals yet.
si: ඔබගේ වෛද්‍යවරයා තවම කිසිදු විශේෂිත ආහාර නියම කර නැත.
ta: உங்கள் மருத்துவர் இன்னும் எந்தவொரு குறிப்பிட்ட உணவுகளையும் பரிந்துரைக்கவில்லை.

source: Today Exercise Preference
si: අද ව්‍යායාම වර්ගය
ta: இன்றைய உடற்பயிற்சி விருப்பம்

source: No Exercise Prescribed
si: ව්‍යායාම නියම කර නැත
ta: உடற்பயிற்சி பரிந்துரைக்கப்படவில்லை

# noExercisePrescribedDesc
source: Your doctor hasn't prescribed any exercises yet.
si: ඔබගේ වෛද්‍යවරයා තවම කිසිදු ව්‍යායාම නියම කර නැත.
ta: உங்கள் மருத்துவர் இன்னும் எந்தவொரு உடற்பயிற்சிகளையும் பரிந்துரைக்கவில்லை.

source: Log Symptoms
si: ලක්ෂණ පටිගත කරන්න
ta: அறிகுறிகளை பதிவு செய்யவும்

source: Health Log
si: සෞඛ්‍ය පටිගතය
ta: உடல்நல பதிவு

source: Recent Health Logs
si: මෑත සෞඛ්‍ය පටිගත
ta: சமீபத்திய உடல்நல பதிவுகள்

source: No Health Logs Yet
si: තවම සෞඛ්‍ය පටිගත නැත
ta: இன்னும் ஆரோக்கிய பதிவுகள் இல்லை

# startLoggingHealthData
source: Start logging your health data to see your history here
si: ඔබගේ ඉතිහාසය බැරෑරුමට ඔබගේ සෞඛ්‍ය දත්ත පටිගත කිරීම අරඹින්න
ta: உங்கள் வரலாற்றைப் பார்க்க உங்கள் உடல்நலத் தரவை பதிவு செய்யத் தொடங்குங்கள்

source: Contact Your Doctors
si: ඔබගේ වෛද්‍යවරුන්ට සම්බන්ධ වන්න
ta: உங்கள் மருத்துவர்களைத் தொடர்பு கொள்ளவும்

source: No Doctors Linked
si: වෛද්‍යවරුන් සම්බන්ධ කර නැත
ta: மருத்துவர்கள் இணைக்கப்படவில்லை

# linkDoctorFirst
source: Please link with a doctor first to enable emergency contact.
si: හදිසියක සම්බන්ධතාවය සක්‍රිය කිරීම සඳහා පළමුව වෛද්‍යවරයෙකු සම්බන්ධ කරන්න.
ta: அவசர தொடர்பை இயக்க முதலில் ஒரு மருத்துவருடன் இணைக்கவும்.

source: Call Doctor
si: වෛද්‍යවරයාට රැගෙන යන්න
ta: மருத்துவரை அழைக்கவும்

# pleaseCallNumber
source: Please call this number:
si: කරුණාකර මෙම අංකයට රැගෙන යන්න:
ta: இந்த எண்ணை அழைக்கவும்:

source: Today's Health Check
si: අද සෞඛ්‍ය පරීක්ෂණය
ta: இன்றைய சுகாதார சோதனை

# bloodPressureExample
source: Blood Pressure (e.g., 120/80)
si: රුධිර පීඩනය (උදා., 120/80)
ta: இரத்த அழுத்தம் (எ.கா., 120/80)

source: Weight (kg)
si: බර (කි.ග්‍රෑ.)
ta: எடை (கி.கி.)

source: Baby Kicks Counter
si: ළදරුවාගේ පා ගණන්ය
ta: குழந்தை உதை எண்ணி

source: How are you feeling?
si: ඔබට කෙසේ හැඟේ වේද?
ta: நீங்கள் எப்படி உணர்கிறீர்கள்?

source: Symptoms (if any)
si: ලක්ෂණ (ඇතිනම්)
ta: அறிகுறிகள் (இருந்தால்)

# sleepHoursExample
source: Sleep Hours (e.g., 8)
si: නින්ද පැය (උදා., 8)
ta: தூக்க நேரம் (எ.கா., 8)

# waterIntakeGlasses
source: Water Intake (glasses/day)
si: ජල පරිභෝජනය (ග්ලාස්/දිනය)
ta: நீர் உட்கொள்ளல் (கிளாஸ்/நாள்)

source: Exercise Minutes (daily)
si: ව්‍යායාම මිනිත්තු (දෛනික)
ta: உடற்பயிற்சி நிமிடங்கள் (தினசரி)

source: Energy Level
si: ශක්තිය මට්ටම
ta: ஆற்றல் மட்டம்

# appetiteLevel
source: Appetite
si: භෝජන ආශාව
ta: உண்ணும் ஆர்வம்

source: Pain Level
si: වේදනා මට්ටම
ta: வலி நிலை

source: Health Indicators
si: සෞඛ්‍ය දක්වනයන්
ta: சுகாதார குறிகாட்டிகள்

source: Had Contractions
si: සංකෝචන තිබුණි
ta: உடலுறுப்பு இறுக்கங்கள் இருந்தன

source: Had Headaches
si: හිසරදය තිබුණි
ta: தலைவலி இருந்தது

source: Had Swelling
si: විඩාවට තිබුණි
ta: வீக்கம் இருந்தது

source: Took Vitamins
si: විටමින් ගත්තෙමි
ta: விட்டமின்கள் எடுத்தேன்

source: Nausea Details (if any)
si: වමනයේ විස්තර (ඇතිනම්)
ta: வாந்தி விவரங்கள் (இருந்தால்)

source: Current Medications
si: වත්මන් ඖෂධ
ta: தற்போதைய மருந்துகள்

source: Additional Notes
si: අමතර සටහන්
ta: கூடுதல் குறிப்புகள்

source: Save Health Log
si: සෞඛ්‍ය පටිගතය සුරක්ෂිත කරන්න
ta: உடல்நல பதிவை சேமிக்கவும்

source: Pregnancy Assistant
si: ගර්භණී සහායක
ta: கர்ப்ப உதவியாளர்

source: AI-powered support
si: AI-ධාවිත සහාය
ta: AI-இயக்கப்பட்ட ஆதரவு

# askPregnancyQuestion
source: Ask a pregnancy-related question...
si: ගර්භණී සම්බන්ධ ප්‍රශ්නයක් අසන්න...
ta: கர்ப்பம் தொடர்பான கேள்வியை கேளுங்கள்...

source: Common Pregnancy Questions
si: පොදු ගර්භණී ප්‍රශ්න
ta: பொதுவான கர்ப்ப கேள்விகள்

source: Thinking...
si: සිතනවා...
ta: சிந்திக்கிறது...

# pregnancyAssistantSender
source: Pregnancy Assistant
si: ගර්භණී සහායක
ta: கர்ப்ப சகாயர்

# avoidFoodsQuestion
source: What foods should I avoid during pregnancy?
si: ගර්භණී කාලයේදී මම කවර ආහාර වලින් වැළකී සිටිය යුතුද?
ta: கர்ப்ப காலத்தில் எந்த உணவுகளைத் தவிர்க்க வேண்டும்?

# safeExercisesQuestion
source: What are safe exercises for the third trimester?
si: තුන්වන තුන්මාසය සඳහා ආරක්ෂිත ව්‍යායාම මොනවාද?
ta: மூன்றாம் காலாண்டில் பாதுகாப்பான உடற்பயிற்சிகள் என்ன?

# relieveMorningSicknessQuestion
source: How can I relieve morning sickness?
si: උදේ නැගීමේ රෝගය අත්හරින්නේ කෙසේද?
ta: காலை நோயை எவ்வாறு குறைக்கலாம்?

# pretermLaborSignsQuestion
source: What are the signs of preterm labor?
si: පූර්ව උත්පාදන ලබරේ සංඥා මොනවාද?
ta: பிறப்புக்கு முன் உழைப்பின் அறிகுறிகள் என்ன?

# weightGainQuestion
source: How much weight should I gain during pregnancy?
si: ගර්භණී කාලයේදී මම කොපමණ බරක් ලබා ගත යුතුද?
ta: கர்ப்ப காலத்தில் எவ்வளவு எடை அதிகரிக்க வேண்டும்?

source: Health Assessment
si: සෞඛ්‍ය මූලාකෘතිය
ta: சுகாதார மதிப்பீடு

source: Assessment Results:
si: මූලාකෘති ප්‍රතිඵල:
ta: மதிப்பீடு முடிவுகள்:

source: Recommendations:
si: නිර්දේශ:
ta: பரிந்துரைகள்:

# highRiskDetected
source: High risk detected! Please contact your healthcare provider immediately.
si: ඉහළ අවදානමක් අනාවරණය විය! කරුණාකර ඔබගේ සෞඛ්‍ය සැපයුම්කරුට වහාම සම්බන්ධ වන්න.
ta: அதிக ஆபத்து கண்டறியப்பட்டது! உடனடியாக உங்கள் சுகாதார வழங்குநரைத் தொடர்பு கொள்ளவும்.

source: Contact Doctor
si: වෛද්‍යවරයාට සම්බන්ධ වන්න
ta: மருத்துவரைத் தொடர்பு கொள்ளவும்

# healthInfoSaved
source: Health information saved and analyzed successfully!
si: සෞඛ්‍ය තොරතුරු සුරක්ෂිත කර පරීක්ෂණය කරන ලදී!
ta: சுகாதார தகவல் சேமிக்கப்பட்டு பகுப்பாய்வு செய்யப்பட்டது!

# errorSavingHealthInfo
source: Error saving health information: {error}
si: සෞඛ්‍ය තොරතුරු සුරක්ෂිත කිරීමේ දෝෂය: {error}
ta: சுகாதார தகவலைச் சேமிப்பதில் பிழை: {error}

source: Phone number not available
si: දුරකථන අංකය නොමැති වේ
ta: தொலைபேசி எண் கிடைக்கவில்லை

# unableToMakeCall
source: Unable to make call: {error}
si: අමතවීමට නොහැකි විය: {error}
ta: அழைப்பைச் செய்ய இயலவில்லை: {error}

# weightLabel
source: Weight
si: බර
ta: எடை

# bpLabel
source: BP
si: රුධිර පීඩනය
ta: இரத்த அழுத்தம்

# kicksLabel
source: Kicks
si: පා
ta: உதை

# sleepLabel
source: Sleep
si: නින්ද
ta: தூக்கம்

# symptomsLabel
source: Symptoms: {symptoms}
si: ලක්ෂණ: {symptoms}
ta: அறிகுறிகள்: {symptoms}

# notesLabel
source: Notes: {notes}
si: සටහන්: {notes}
ta: குறிப்புகள்: {notes}

# enterBloodPressure
source: Please enter your blood pressure
si: කරුණාකර ඔබගේ රුධිර පීඩනය ඇතුල් කරන්න
ta: உங்கள் இரத்த அழுத்தத்தை உள்ளீடு செய்யவும்

# enterWeight
source: Please enter your weight
si: කරුණාකර ඔබගේ බර ඇතුල් කරන්න
ta: உங்கள் எடையை உள்ளீடு செய்யவும்

# enterSleepHours
source: Please enter sleep hours
si: කරුණාකර නින්ද පැය ඇතුල් කරන්න
ta: தூக்க நேரத்தை உள்ளீடு செய்யவும்

# enterWaterIntake
source: Please enter water intake
si: කරුණාකර ජල පරිභෝජනය ඇතුල් කරන්න
ta: நீர் உட்கொள்ளலை உள்ளீடு செய்யவும்

# enterExerciseMinutes
source: Please enter exercise minutes
si: කරුණාකර ව්‍යායාම මිනිත්තු ඇතුල් කරන්න
ta: உடற்பயிற்சி நிமிடங்களை உள்ளீடு செய்யவும்

# errorLoadingDoctors
source: Error loading doctors: {error}
si: වෛද්‍යවරුන් පූරණය කිරීමේ දෝෂය: {error}
ta: மருத்துவர்களை ஏற்றுவதில் பிழை: {error}

source: Start Your Pregnancy Journey
si: ඔබගේ ගැබ්බුම් ගමන අරඹින්න
ta: உங்கள் கர்ப்பப் பயணத்தைத் தொடங்குங்கள்

# completePregnancyDetails
source: Complete your pregnancy details in your profile to start tracking your journey.
si: ඔබගේ යාත්‍රාව නිරීක්ෂණය කිරීමට ඔබගේ පැතිකඩේ ගැබ්ගැනීමේ විස්තර සම්පූර්ණ කරන්න.
ta: கண்காணிப்பத் தொடங்க உங்கள் கர்ப்ப விவரங்களை நிறைவு செய்யுங்கள்

source: Setup Pregnancy Tracking
si: ගැබ්බුම් ලුහුබඳිනවා ස්ථාපනය කරන්න
ta: கர்ப்ப கண்காணிப்பை அமைக்கவும்

source: Your Pregnancy Journey
si: ඔබගේ ගැබ්බුම් ගමන
ta: உங்கள் கர்ப்பப் பயணம்

# trimesterLabel
source: {trimester} Trimester
si: {trimester} තුන්මාසය
ta: {trimester} மூன்றாம் பங்கு

# weeksLabel
source: weeks
si: සති
ta: வாரங்கள்

source: Expected Due Date
si: අපේක්ෂිත ප්‍රසූති දිනය
ta: எதிர்பார்க்கப்படும் பிரசவ தேதி

source: This Week's Development
si: මෙම සතියේ වර්ධනය
ta: இந்த வாரத்தின் வளர்ச்சி

source: View Full Journey
si: සම්පූර්ණ ගමන බලන්න
ta: முழு பயணத்தையும் பார்க்கவும்

source: Pregnancy Milestones
si: ගැබ්ගැනීමේ මෝඩ්ස්ටෝන්
ta: கர்ப்ப மைல்கற்கள்

source: Heart Begins
si: හදවත අරඹෙයි
ta: இதயம் தொடங்குகிறது

source: All Organs
si: සියලුම ආයතන
ta: அனைத்து உறுப்புகளும்

# endFirstTrimester
source: End 1st Trimester
si: පළමු තුන්මාසය අවසානය
ta: முதல் மூன்றாம் பங்கு முடிவு

source: Halfway Point
si: මධ්‍යම ලකුණ
ta: பாதி புள்ளி

source: Viability
si: ජීවිතයේ හැකියාව
ta: வாழ்க்கைத்தன்மை

source: Eyes Open
si: ඇස් විවෘත වේ
ta: கண்கள் திறக்கும்

source: Rapid Growth
si: වේගවත් වර්ධනය
ta: விரைவான வளர்ச்சி

source: Full Term Soon
si: පූර්ණ කාලය ඉක්මනින්
ta: முழு காலம் விரைவில்

source: Due Date
si: නියමිත දිනය
ta: பிரசவ தேதி

# babyGrowing
source: {babyName} is growing!
si: {babyName} වැඩෙමින් සිටී!
ta: {babyName} வளர்ந்து வருகிறது!

# dayLabel
source: Day {totalDays}
si: දිනය {totalDays}
ta: நாள் {totalDays}

# weeksDaysLabel
source: {weeks} weeks, {days} days
si: {weeks} සති, {days} දින
ta: {weeks} வாரங்கள், {days} நாட்கள்

# timeRemaining
source: {weeksRemaining} weeks, {daysRemaining} days to go
si: {weeksRemaining} සති, {daysRemaining} දින තවම තියෙනවා
ta: {weeksRemaining} வாரங்கள், {daysRemaining} நாட்கள் மீதமுள்ளன

# progressComplete
source: {percentage}% complete ({totalDays}/280 days)
si: {percentage}% සම්පූර්ණ ({totalDays}/280 දින)
ta: {percentage}% முழுமையானது ({totalDays}/280 நாட்கள்)

# babyDevWeek4
source: Your baby is just beginning to develop. The fertilized egg is implanting in your uterus.
si: ඔබගේ දරුවා දැන් වර්ධනය අරඹිමින් සිටී. ගැබ්බුම් කළ බිත්තරය ඔබගේ ගර්භාශයේ සවි කරනවා.
ta: உங்கள் குழந்தை இப்போது வளர்ச்சியைத் தொடங்குகிறது. உரமாக்கப்பட்ட முட்டை உங்கள் கர்ப்பப்பையில் பொருத்தப்படுகிறது.

# babyDevWeek8
source: Your baby's heart is starting to beat and major organs are beginning to form.
si: ඔබගේ දරුවාගේ හදවත දැන් පිටතට එනවා සහ ප්‍රධාන ආයතන රූපගැනීමට පටන් ගන්නවා.
ta: உங்கள் குழந்தையின் இதயம் துடிக்கத் தொடங்குகிறது மற்றும் முக்கிய உறுப்புகள் உருவாகத் தொடங்குகின்றன.

# babyDevWeek12
source: Your baby is now about the size of a lime and all major organs are formed.
si: ඔබගේ දරුවා දැන් ලයිම් පළතුරක ප්‍රමාණයේ සහ සියලුම ප්‍රධාන ආයතන රූපගත්තා.
ta: உங்கள் குழந்தை இப்போது ஒரு சாத்துக்குடி அளவில் உள்ளது மற்றும் அனைத்து முக்கிய உறுப்புகளும் உருவாகியுள்ளன.

# babyDevWeek16
source: Your baby can now make facial expressions and may even be sucking their thumb.
si: ඔබගේ දරුවාට දැන් මුහුදු ප්‍රකාශන කළ හැකි සහ ඔවුන්ගේ අත් බෑගය පොළුවට ගත හැකි.
ta: உங்கள் குழந்தை இப்போது முக பாவனைகளைச் செய்ய முடியும் மற்றும் அவர்களின் கட்டைவிரலை உறிஞ்சக்கூடும்.

# babyDevWeek20
source: Your baby is about the size of a banana and you might start feeling movement soon.
si: ඔබගේ දරුවා දැන් කෙසෙල් පළතුරක ප්‍රමාණයේ සහ ඔබට ඉක්මනින් චලනය දැනගත හැකි වේවි.
ta: உங்கள் குழந்தை இப்போது ஒரு வாழைப்பழம் அளவில் உள்ளது மற்றும் விரைவில் இயக்கத்தை உணரத் தொடங்கலாம்.

# babyDevWeek24
source: Your baby's hearing is developing and they can hear your voice and heartbeat.
si: ඔබගේ දරුවාගේ ශ්‍රවණය වර්ධනය වෙමින් සිටී සහ ඔවුන්ට ඔබගේ කටහඬ සහ හදවතේ පිටතට එනවාට ඇසිය හැකි.
ta: உங்கள் குழந்தையின் கேள்வி வளர்ச்சியடைகிறது மற்றும் அவர்களின் குரல் மற்றும் இதயத் துடிப்பைக் கேட்க முடியும்.

# babyDevWeek28
source: Your baby's eyes can now open and close, and they may have hiccups.
si: ඔබගේ දරුවාගේ ඇස් දැන් විවෘත කළ හැකි සහ වසා ගත හැකි, සහ ඔවුන්ට හික්ස් තියෙනවා විය හැකි.
ta: உங்கள் குழந்தையின் கண்கள் இப்போது திறக்க முடியும் மற்றும் மூட முடியும், மற்றும் அவர்களுக்கு ஹிக்ஸ் இருக்கலாம்.

# babyDevWeek32
source: Your baby is gaining weight rapidly and their bones are hardening.
si: ඔබගේ දරුවා වේගවත්ව බර ලබා ගනිමින් සිටී සහ ඔවුන්ගේ පටක වැඩිදුරටත් ශක්තිමත් වෙමින් සිටී.
ta: உங்கள் குழந்தை விரைவாக எடை அதிகரித்து, அவர்களின் எலும்புகள் கடினமாகின்றன.

# babyDevWeek36
source: Your baby's lungs are maturing and they're getting ready for life outside the womb.
si: ඔබගේ දරුවාගේ පෙනහළු මුදුන් වර්ධනය වෙමින් සිටී සහ ඔවුන් ගර්භාශයට පිටත ජීවිතයට සූදානම් වෙමින් සිටී.
ta: உங்கள் குழந்தையின் நுரையீரல் முதிர்ந்து வருகிறது மற்றும் கர்ப்பத்திற்கு வெளியே வாழ்க்கைக்கு தயாராகிறது.

# babyDevWeek40
source: Your baby is full-term and ready to meet you! They could arrive any day now.
si: ඔබගේ දරුවා පූර්ණ කාලීන සහ ඔබව හමුවීමට සූදානම්! ඔවුන් ඕනෑම දිනක පැමිණිය හැකි.
ta: உங்கள் குழந்தை முழு காலமாக உள்ளது மற்றும் உங்களைச் சந்திக்கத் தயாராக உள்ளது! அவர்கள் எந்த நாளும் வரலாம்.

source: Consultation
si: උපදේශනය
ta: ஆலோசனை

source: Loading consultation data...
si: උපදේශන දත්ත පූරණය කරමින්...
ta: ஆலோசனை தரவை ஏற்றுகிறது...

source: Your Doctors
si: ඔබගේ වෛද්‍යවරු
ta: உங்கள் மருத்துவர்கள்

source: Quick Chat
si: ඉක්මන් කතාබහ
ta: விரைவு அரட்டை

# noDoctorsLinkedDesc
source: You haven't linked with any doctors yet. Visit your profile to send connection requests to healthcare professionals.
si: ඔබ තවම වෛද්‍යවරුන් සමඟ සම්බන්ධ වී නැත. සෞඛ්‍ය සේවා සපයන්නන්ට සම්බන්ධතා ඉල්ලීම් යැවීම සඳහා ඔබගේ පැතිකඩට යන්න.
ta: நீங்கள் இன்னும் மருத்துவர்களுடன் இணைக்கவில்லை. சுகாதார நிபுணர்களிடம் இணைப்பு கோரிக்கைகளை அனுப்ப உங்கள் சுயவிவரத்தைப் பார்வையிடுங்கள்.

source: Refresh
si: නැවත පූරණය කරන්න
ta: புதுப்பிக்கவும்

# scheduleAppointment
source: Schedule an appointment with your doctor
si: ඔබගේ වෛද්‍යවරයා සමඟ නියම කිරීමක් සකස් කරන්න
ta: உங்கள் மருத்துவருடன் ஒரு நியமனத்தை திட்டமிடுங்கள்

source: Choose your doctor
si: ඔබගේ වෛද්‍යවරයා තෝරන්න
ta: உங்கள் மருத்துவரைத் தேர்ந்தெடுக்கவும்

source: Select Date
si: දිනය තෝරන්න
ta: தேதியைத் தேர்ந்தெடுக்கவும்

source: Choose appointment date
si: නියම කිරීම් දිනය තෝරන්න
ta: நியமன தேதியைத் தேர்ந்தெடுக்கவும்

source: Select Time
si: වේලාව තෝරන්න
ta: நேரத்தைத் தேர்ந்தெடுக்கவும்

source: Reason for Visit
si: පැමිණීමේ හේතුව
ta: வருகைக்கான காரணம்
